; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	spectrograph0 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star11 - direction
	Star0 - direction
	GroundStation9 - direction
	Star6 - direction
	Star2 - direction
	GroundStation5 - direction
	Star7 - direction
	Star8 - direction
	Star10 - direction
	GroundStation4 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star7)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star10)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 Star8)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star10)
	(calibration_target instrument5 Star8)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star15)
	(supports instrument6 spectrograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(pointing satellite2 Phenomenon13)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 image1)
	(have_image Star15 spectrograph0)
	(have_image Planet16 spectrograph0)
))

)

; plan
1. (turn_to satellite2 groundstation4 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation4)
   goals met: 0 of 6
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 6
3. (calibrate satellite2 instrument6 groundstation4)
   added: (calibrated instrument6)
   goals met: 0 of 6
4. (turn_to satellite2 star14 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star14)
   goals met: 0 of 6
5. (take_image satellite2 star14 instrument6 image1)
   added: (have_image star14 image1)
   goals met: 1 of 6
6. (turn_to satellite2 star12 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star12)
   goals met: 1 of 6
7. (take_image satellite2 star12 instrument6 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 2 of 6
8. (turn_to satellite2 planet16 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 planet16)
   goals met: 2 of 6
9. (take_image satellite2 planet16 instrument6 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 3 of 6
10. (turn_to satellite2 star15 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 star15)
   goals met: 3 of 6
11. (take_image satellite2 star15 instrument6 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 4 of 6
12. (turn_to satellite2 phenomenon13 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 phenomenon13)
   goals met: 5 of 6
13. (take_image satellite2 phenomenon13 instrument6 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 6 of 6
